#Задания комплекта 1: Потоки в Python. 
#Раскоментируйте импорт для корректной работы программы.
#blok1_1 - Создание нескольких потоков и вывод имен
#blok1_2 - Загрузка нескольких файлов с использованием потоков
#blok1_3 - Одновременные HTTP-запросы с использованием потоков
#blok1_4 - Вычисление факториала числа с использованием потоков
#blok1_5 - Многопоточная быстрая сортировка

#import blok1_1
#import blok1_2
#import blok1_3
#import blok1_4
#import blok1_5

#Задания комплекта 2: Concurrency и Futures в Python. 
#Раскоментируйте импорт для работы программы.

#blok2_2 - Программа симуляции банка с использованием потоков и Lock
#blok2_3 - Программа для асинхронной загрузки изображений с использованием объектов типа Future и семафора
#blok2_4 - Программа для записи и чтения данных из файла с использованием объектов типа Future
#blok2_5 - Программа с использованием объекта типа Event
#blok2_6 - Программа с собственным классом "очередь" (Queue) и рекурсивным блокировщиком RLock
#blok2_7 - Программа с двумя потоками сервера и клиента, используется threading.Barrier
#blok2_8 - Программа для параллельного поиска файла в директории


#import blok2_2
#import blok2_3
#import blok2_4
#import blok2_5
#import blok2_6
#import blok2_7
#import blok2_8
